docs(README): make things better to look at
